#!/bin/bash
set -e

f() {
    d="$1"
    k="$2"
    printf '"c96sel%s":[\n' $d
    while IFS=' ' read -r r b1 b2; do
        [ -z "$c" ] || [ "$c" -le 6 ] && c=10
        c=$((c-1))
        # {"c96sel2":[{"loc":"2南ネ01b","sc":"8"},
        # {"loc":"2南ネ02a","sc":"9"}],"c96sel4":[]}
        printf '%s{"loc":"%s%s%s%02da","sc":"%s"}\n' "$co" "$d" "$k" "$r" "$b1" "$c"
        printf  ',{"loc":"%s%s%s%02db","sc":"%s"}\n'       "$d" "$k" "$r" "$b2" "$c"
        co=,
    done
}

printf '{'

{ cat <<EOF
ト 23 1
ア 48 4
テ 24 2
ツ 25 3
チ 24 4
タ 25 5
ソ 28 6
セ 31 7
ス 32 8
シ 33 9
サ 34 13
コ 35 14
ケ 34 15
ク 35 16
キ 34 17
カ 35 18
オ 36 19
エ 41 20
ウ 42 21
イ 43 22
EOF
} | f 4 南

printf '],'

{ cat <<EOF
ナ 43 11
リ 24 1
ラ 25 2
ヨ 26 3
ユ 23 4
ヤ 24 5
モ 25 6
メ 30 7
ム 31 8
ミ 32 9
マ 33 13
ホ 34 14
ヘ 35 15
フ 36 16
ヒ 33 17
ハ 34 18
ノ 39 19
ネ 40 20
ヌ 41 21
ニ 42 22
EOF
} | f 3 南

printf ']}\n'
